In [1]:
#configure jupyter notebook to run SQL commands
%load_ext sql

In [2]:
#connect to database
#database is a sqlite database file stored locally, 
#it is a open source db, refer to README for download location
%sql sqlite:////Users/admin/personal_projs/sql_practice/data/Chinook_Sqlite.sqlite

'Connected: @/Users/admin/personal_projs/sql_practice/data/Chinook_Sqlite.sqlite'

## Subqueries

**Subquery in SELECT**

In [3]:
%%sql result <<
SELECT BillingCountry, 
(SUM(Total)/(SELECT SUM(Total) FROM Invoice))*100 AS Perc_Rev
FROM Invoice
GROUP BY BillingCountry;

 * sqlite:////Users/admin/personal_projs/sql_practice/data/Chinook_Sqlite.sqlite
Done.
Returning data to local variable result

In [4]:
result

[('Argentina', 1.6155629992270006),
 ('Australia', 1.6155629992270006),
 ('Austria', 1.8302842909902912),
 ('Belgium', 1.6155629992270004),
 ('Brazil', 8.163703512840318),
 ('Canada', 13.053336768873978),
 ('Chile', 2.0020613244009238),
 ('Czech Republic', 3.875289873743874),
 ('Denmark', 1.6155629992270006),
 ('Finland', 1.7873400326376334),
 ('France', 8.378424804603608),
 ('Germany', 6.719917547023951),
 ('Hungary', 1.959117066048266),
 ('India', 3.231984883621054),
 ('Ireland', 1.959117066048266),
 ('Italy', 1.6155629992270006),
 ('Netherlands', 1.744395774284975),
 ('Norway', 1.7014515159323167),
 ('Poland', 1.6155629992270006),
 ('Portugal', 3.3170145151593164),
 ('Spain', 1.6155629992270004),
 ('Sweden', 1.658507257579659),
 ('USA', 22.4624237739414),
 ('United Kingdom', 4.846688997681001)]

**Subquery in FROM**

In [6]:
%%sql result <<
SELECT names_with_the.*
FROM (SELECT Name FROM Artist WHERE Name LIKE '%The%') AS names_with_the
LIMIT 10;

 * sqlite:////Users/admin/personal_projs/sql_practice/data/Chinook_Sqlite.sqlite
Done.
Returning data to local variable result

In [7]:
result

[('Santana Feat. Dave Matthews',),
 ('Santana Feat. The Project G&B',),
 ('The Black Crowes',),
 ('The Clash',),
 ('The Cult',),
 ('The Doors',),
 ('The Police',),
 ('The Rolling Stones',),
 ('The Tea Party',),
 ('The Who',)]

**Subquery in WHERE**

In [8]:
%%sql result <<
SELECT EmployeeId, FirstName, LastName
FROM Employee
WHERE EmployeeId IN (SELECT DISTINCT ReportsTo 
                        FROM Employee);

 * sqlite:////Users/admin/personal_projs/sql_practice/data/Chinook_Sqlite.sqlite
Done.
Returning data to local variable result

In [9]:
result

[(1, 'Andrew', 'Adams'), (2, 'Nancy', 'Edwards'), (6, 'Michael', 'Mitchell')]

In [10]:
%%sql result <<
SELECT EmployeeId, 
FirstName || ' ' || LastName AS Name
FROM Employee
WHERE EmployeeId IN (SELECT DISTINCT ReportsTo 
                        FROM Employee);

 * sqlite:////Users/admin/personal_projs/sql_practice/data/Chinook_Sqlite.sqlite
Done.
Returning data to local variable result

In [11]:
result

[(1, 'Andrew Adams'), (2, 'Nancy Edwards'), (6, 'Michael Mitchell')]

In [18]:
%%sql result <<
SELECT FirstName, LastName, BirthDate
FROM Employee
WHERE BirthDate IN (SELECT BirthDate FROM Employee ORDER BY BirthDate LIMIT 10)

 * sqlite:////Users/admin/personal_projs/sql_practice/data/Chinook_Sqlite.sqlite
Done.
Returning data to local variable result

In [19]:
result

[('Andrew', 'Adams', '1962-02-18 00:00:00'),
 ('Nancy', 'Edwards', '1958-12-08 00:00:00'),
 ('Jane', 'Peacock', '1973-08-29 00:00:00'),
 ('Margaret', 'Park', '1947-09-19 00:00:00'),
 ('Steve', 'Johnson', '1965-03-03 00:00:00'),
 ('Michael', 'Mitchell', '1973-07-01 00:00:00'),
 ('Robert', 'King', '1970-05-29 00:00:00'),
 ('Laura', 'Callahan', '1968-01-09 00:00:00')]